/*************************************************************************
    > 文件名称 : 9.c
    > 创 建 者 : hxq
    > E--mail  : 1038403210@qq.com
    > 创建时间 : 2018年02月07日15时22分20秒
    > 描   述  : 
 ************************************************************************/
#include<stdio.h>

int main(int argc, char *argv[])
{
	float d1,d2,d3,d4;
	d1=1.01;
	d2=1;
	d3=0.01;
	d4=d1-d2;
	if(d4>d3)
	{
		printf("大于0.01\n");
	}
	else if(d4<d3)
	{
		printf("小于0.01\n");
	}
	else 
		printf("等于0.01\n");
	printf("%f - %f = %f\n",d1,d2,d4);
    return 0;
}
